wintersmith/contents/articles/Perl/2013-01-09-create-sql-from-schema.html
---
date: 2013-01-09
template: tech.jade
title: 从DBIx::Class的Schema类生成SQL语句
category: Perl
change_frequency: monthly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">从Schema生成SQL语句</a></li>
</ul>
</div>
</div>
<p>
<a href="http://search.cpan.org/perldoc?DBIx::Class::Admin">DBIx::Class::Admin</a> 模块提供了数据库管理的一些功能，如：部署,升级版本，更新数据，插入数据，删除，查询和生成数据库SQL表。
</p>

<p>
这个模块还附带了一个命令行的工具： <b>dbicadmin</b> ，帮助我们不必写perl脚本就可以使用它的功能。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">从Schema生成SQL语句</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sh">dbicadmin --schema=PeSystem::Schema \
	  --connect='["db:Pg:dbname=pesystem","dbuser","dbpassword"]' \
	  --op=create \
	  --sql-type=PostgreSQL \
	  --sql-dir=./sql/
</pre>
</div>

<p>
这条命令在 <i>./sql/</i> 目录下生成 <i>PeSystem::Schema</i> 的SQL语句文件: <i>PeSystem-Schema-1.x-PostgreSQL.sql</i> 。
</p>
</div>
</div>
